print("===== โปรแกรมคำนวณพื้นที่ =====")
print("1. สี่เหลี่ยมมุมฉาก")
print("2. สามเหลี่ยม")
print("3. วงกลม")

เลือก = input("เลือกประเภทการคำนวณ (1-3): ")

if เลือก == "1":
    กว้าง = float(input("กรอกความกว้าง (เมตร): "))
    ยาว = float(input("กรอกความยาว (เมตร): "))

    if กว้าง > 0 and ยาว > 0:
        พื้นที่ = กว้าง * ยาว
        print("พื้นที่สี่เหลี่ยม =", พื้นที่, "ตารางเมตร")
    else:
        print("กรุณากรอกค่ามากกว่า 0")

elif เลือก == "2":
    ฐาน = float(input("กรอกความยาวฐาน (เมตร): "))
    สูง = float(input("กรอกความสูง (เมตร): "))

    if ฐาน > 0 and สูง > 0:
        พื้นที่ = 0.5 * ฐาน * สูง
        print("พื้นที่สามเหลี่ยม =", พื้นที่, "ตารางเมตร")
    else:
        print("กรุณากรอกค่ามากกว่า 0")

elif เลือก == "3":
    รัศมี = float(input("กรอกรัศมี (เมตร): "))

    if รัศมี > 0:
        พื้นที่ = 3.14 * รัศมี * รัศมี
        print("พื้นที่วงกลม =", พื้นที่, "ตารางเมตร")
    else:
        print("กรุณากรอกค่ามากกว่า 0")

else:
    print("เลือกเมนูไม่ถูกต้อง")